Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_timer.c
  tmpVal = BL_RD_WORD(TIMER_BASE + TIMER_TMR2_0_OFFSET + 4 * (TIMER_MAX_MATCH * timerCh + cmpNo));
  return tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER set specified channel and comparator compare value
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                * @param  cmpNo: TIMER comparator ID type
                                                                                * @param  val: TIMER match comapre register value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_SetCompValue(TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo, uint32_t val) {
  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
  CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

  BL_WR_WORD(TIMER_BASE + TIMER_TMR2_0_OFFSET + 4 * (TIMER_MAX_MATCH * timerCh + cmpNo), val);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER get the specified channel count value
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                *
                                                                                * @return TIMER count register value
                                                                                *
                                                                                *******************************************************************************/
uint32_t TIMER_GetCounterValue(TIMER_Chan_Type timerCh) {
  uint32_t tmpVal;
  uint32_t tmpAddr;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

  /* TO avoid risk of reading, don't read TCVWR directly*/
  /* request for read*/
  tmpAddr = TIMER_BASE + TIMER_TCVWR2_OFFSET + 4 * timerCh;
  BL_WR_WORD(tmpAddr, 1);

  /* Need wait */
  tmpVal = BL_RD_WORD(tmpAddr);
  tmpVal = BL_RD_WORD(tmpAddr);
  tmpVal = BL_RD_WORD(tmpAddr);

  return tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER get specified channel and comparator match status
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                * @param  cmpNo: TIMER comparator ID type
                                                                                *
                                                                                * @return SET or RESET
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type TIMER_GetMatchStatus(TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo) {
  uint32_t    tmpVal;
  BL_Sts_Type bitStatus = RESET;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
  CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

  tmpVal = BL_RD_WORD(TIMER_BASE + TIMER_TMSR2_OFFSET + 4 * timerCh);

  switch (cmpNo) {
  case TIMER_COMP_ID_0:
    bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TMSR_0) ? SET : RESET;
    break;

  case TIMER_COMP_ID_1:
    bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TMSR_1) ? SET : RESET;
    break;

  case TIMER_COMP_ID_2:
    bitStatus = BL_IS_REG_BIT_SET(tmpVal, TIMER_TMSR_2) ? SET : RESET;
    break;

  default:
    break;
  }

  return bitStatus;
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER get specified channel preload value
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                *
                                                                                * @return Preload register value
                                                                                *
                                                                                *******************************************************************************/
uint32_t TIMER_GetPreloadValue(TIMER_Chan_Type timerCh) {
  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

  return BL_RD_WORD(TIMER_BASE + TIMER_TPLVR2_OFFSET + 4 * timerCh);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER set preload register low 32bits value
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                * @param  val: Preload register low 32bits value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_SetPreloadValue(TIMER_Chan_Type timerCh, uint32_t val) {
  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

  BL_WR_WORD(TIMER_BASE + TIMER_TPLVR2_OFFSET + 4 * timerCh, val);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER set preload trigger source,COMP0,COMP1,COMP2 or None
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                * @param  plSrc: TIMER preload source type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_SetPreloadTrigSrc(TIMER_Chan_Type timerCh, TIMER_PreLoad_Trig_Type plSrc) {
  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
  CHECK_PARAM(IS_TIMER_PRELOAD_TRIG_TYPE(plSrc));

