Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_timer.c
  BL_WR_WORD(TIMER_BASE + TIMER_TPLCR2_OFFSET + 4 * timerCh, plSrc);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER set count mode:preload or free run
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                * @param  countMode: TIMER count mode: TIMER_COUNT_PRELOAD or TIMER_COUNT_FREERUN
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_SetCountMode(TIMER_Chan_Type timerCh, TIMER_CountMode_Type countMode) {
  uint32_t tmpval;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
  CHECK_PARAM(IS_TIMER_COUNTMODE_TYPE(countMode));

  tmpval = BL_RD_WORD(TIMER_BASE + TIMER_TCMR_OFFSET);
  tmpval &= (~(1 << (timerCh + 1)));
  tmpval |= (countMode << (timerCh + 1));

  BL_WR_WORD(TIMER_BASE + TIMER_TCMR_OFFSET, tmpval);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER clear interrupt status
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                * @param  cmpNo: TIMER macth comparator ID type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_ClearIntStatus(TIMER_Chan_Type timerCh, TIMER_Comp_ID_Type cmpNo) {
  uint32_t tmpAddr;
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
  CHECK_PARAM(IS_TIMER_COMP_ID_TYPE(cmpNo));

  tmpAddr = TIMER_BASE + TIMER_TICR2_OFFSET + 4 * timerCh;

  tmpVal = BL_RD_WORD(tmpAddr);
  tmpVal |= (1 << cmpNo);

  BL_WR_WORD(tmpAddr, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER initialization function
                                                                                *
                                                                                * @param  timerCfg: TIMER configuration structure pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type TIMER_Init(TIMER_CFG_Type *timerCfg) {
  TIMER_Chan_Type timerCh = timerCfg->timerCh;
  uint32_t        tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CLKSRC_TYPE(timerCfg->clkSrc));
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCfg->timerCh));
  CHECK_PARAM(IS_TIMER_PRELOAD_TRIG_TYPE(timerCfg->plTrigSrc));
  CHECK_PARAM(IS_TIMER_COUNTMODE_TYPE(timerCfg->countMode));

  /* Configure timer clock source */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCCR);

  if (timerCh == TIMER_CH0) {
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_1, timerCfg->clkSrc);
  } else {
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_2, timerCfg->clkSrc);
  }

  BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmpVal);

  /* Configure timer clock division */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);

  if (timerCh == TIMER_CH0) {
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_TCDR2, timerCfg->clockDivision);
  } else {
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_TCDR3, timerCfg->clockDivision);
  }

  BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmpVal);

  /* Configure timer count mode: preload or free run */
  TIMER_SetCountMode(timerCh, timerCfg->countMode);

  /* Configure timer preload trigger src */
  TIMER_SetPreloadTrigSrc(timerCh, timerCfg->plTrigSrc);

  if (timerCfg->countMode == TIMER_COUNT_PRELOAD) {
    /* Configure timer preload value */
    TIMER_SetPreloadValue(timerCh, timerCfg->preLoadVal);

    /* Configure match compare values */
    if (timerCfg->matchVal0 > 1 + timerCfg->preLoadVal) {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0 - 2);
    } else {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0);
    }

    if (timerCfg->matchVal1 > 1 + timerCfg->preLoadVal) {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1 - 2);
    } else {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1);
    }

    if (timerCfg->matchVal2 > 1 + timerCfg->preLoadVal) {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2 - 2);
    } else {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2);
    }
  } else {
    /* Configure match compare values */
    if (timerCfg->matchVal0 > 1) {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0 - 2);
    } else {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_0, timerCfg->matchVal0);
    }

    if (timerCfg->matchVal1 > 1) {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1 - 2);
    } else {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_1, timerCfg->matchVal1);
    }

