Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_timer.c
    if (timerCfg->matchVal2 > 1) {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2 - 2);
    } else {
      TIMER_SetCompValue(timerCh, TIMER_COMP_ID_2, timerCfg->matchVal2);
    }
  }

#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(TIMER_CH0_IRQn, TIMER_CH0_IRQHandler);
  Interrupt_Handler_Register(TIMER_CH1_IRQn, TIMER_CH1_IRQHandler);
#endif

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER enable one channel function
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_Enable(TIMER_Chan_Type timerCh) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCER);
  tmpVal |= (1 << (timerCh + 1));

  BL_WR_REG(TIMER_BASE, TIMER_TCER, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER disable one channel function
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_Disable(TIMER_Chan_Type timerCh) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));

  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCER);
  tmpVal &= (~(1 << (timerCh + 1)));

  BL_WR_REG(TIMER_BASE, TIMER_TCER, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER mask or unmask certain or all interrupt
                                                                                *
                                                                                * @param  timerCh: TIMER channel type
                                                                                * @param  intType: TIMER interrupt type
                                                                                * @param  intMask: TIMER interrupt mask value:MASK:disbale interrupt.UNMASK:enable interrupt
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void TIMER_IntMask(TIMER_Chan_Type timerCh, TIMER_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpAddr;
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CHAN_TYPE(timerCh));
  CHECK_PARAM(IS_TIMER_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  tmpAddr = TIMER_BASE + TIMER_TIER2_OFFSET + 4 * timerCh;
  tmpVal  = BL_RD_WORD(tmpAddr);

  switch (intType) {
  case TIMER_INT_COMP_0:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER_0));
    } else {
      /* Disable this interrupt */
      BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER_0));
    }

    break;

  case TIMER_INT_COMP_1:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER_1));
    } else {
      /* Disable this interrupt */
      BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER_1));
    }

    break;

  case TIMER_INT_COMP_2:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER_2));
    } else {
      /* Disable this interrupt */
      BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER_2));
    }

    break;

  case TIMER_INT_ALL:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER_0));
      BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER_1));
      BL_WR_WORD(tmpAddr, BL_SET_REG_BIT(tmpVal, TIMER_TIER_2));
    } else {
      /* Disable this interrupt */
      BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER_0));
      BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER_1));
      BL_WR_WORD(tmpAddr, BL_CLR_REG_BIT(tmpVal, TIMER_TIER_2));
    }

    break;

  default:
    break;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER set watchdog clock source and clock division
                                                                                *
                                                                                * @param  clkSrc: Watchdog timer clock source type
                                                                                * @param  div: Watchdog timer clock division value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void WDT_Set_Clock(TIMER_ClkSrc_Type clkSrc, uint8_t div) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_TIMER_CLKSRC_TYPE(clkSrc));

  /* Configure watchdog timer clock source */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCCR);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_CS_WDT, clkSrc);
  BL_WR_REG(TIMER_BASE, TIMER_TCCR, tmpVal);

  /* Configure watchdog timer clock divison */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_TCDR);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, TIMER_WCDR, div);
  BL_WR_REG(TIMER_BASE, TIMER_TCDR, tmpVal);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER get watchdog match compare value
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Watchdog match comapre register value
                                                                                *
                                                                                *******************************************************************************/
uint16_t WDT_GetMatchValue(void) {
  uint32_t tmpVal;

  WDT_ENABLE_ACCESS();

