Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_timer.c
  /* Get watchdog timer match register value */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WMR);

  return tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER set watchdog match compare value
                                                                                *
                                                                                * @param  val: Watchdog match compare value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void WDT_SetCompValue(uint16_t val) {
  WDT_ENABLE_ACCESS();

  /* Set watchdog timer match register value */
  BL_WR_REG(TIMER_BASE, TIMER_WMR, val);
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER get watchdog count register value
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return Watchdog count register value
                                                                                *
                                                                                *******************************************************************************/
uint16_t WDT_GetCounterValue(void) {
  uint32_t tmpVal;

  WDT_ENABLE_ACCESS();

  /* Get watchdog timer count register value */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WVR);

  return tmpVal;
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER reset watchdog count register value
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void WDT_ResetCounterValue(void) {
  uint32_t tmpVal;

  /* Reset watchdog timer count register value */
  WDT_ENABLE_ACCESS();

  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WCR);

  /* Set watchdog counter reset register bit0 to 1 */
  BL_WR_REG(TIMER_BASE, TIMER_WCR, BL_SET_REG_BIT(tmpVal, TIMER_WCR));
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER get watchdog reset status
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return SET or RESET
                                                                                *
                                                                                *******************************************************************************/
BL_Sts_Type WDT_GetResetStatus(void) {
  uint32_t tmpVal;

  WDT_ENABLE_ACCESS();

  /* Get watchdog status register */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WSR);

  return (BL_IS_REG_BIT_SET(tmpVal, TIMER_WTS)) ? SET : RESET;
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER clear watchdog reset status
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void WDT_ClearResetStatus(void) {
  uint32_t tmpVal;

  WDT_ENABLE_ACCESS();

  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WSR);

  /* Set watchdog status register */
  BL_WR_REG(TIMER_BASE, TIMER_WSR, BL_CLR_REG_BIT(tmpVal, TIMER_WTS));
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER enable watchdog function
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void WDT_Enable(void) {
  uint32_t tmpVal;

