Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_timer.c
#ifndef BFLB_USE_HAL_DRIVER
  Interrupt_Handler_Register(TIMER_WDT_IRQn, TIMER_WDT_IRQHandler);
#endif

  WDT_ENABLE_ACCESS();

  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WMER);

  BL_WR_REG(TIMER_BASE, TIMER_WMER, BL_SET_REG_BIT(tmpVal, TIMER_WE));
}

/****************************************************************************/ /**
                                                                                * @brief  Watchdog timer disable function
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void WDT_Disable(void) {
  uint32_t tmpVal;

  WDT_ENABLE_ACCESS();

  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WMER);

  BL_WR_REG(TIMER_BASE, TIMER_WMER, BL_CLR_REG_BIT(tmpVal, TIMER_WE));
}

/****************************************************************************/ /**
                                                                                * @brief  Watchdog timer mask or unmask certain or all interrupt
                                                                                *
                                                                                * @param  intType: Watchdog interrupt type
                                                                                * @param  intMask: Watchdog interrupt mask value:MASK:disbale interrupt.UNMASK:enable interrupt
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void WDT_IntMask(WDT_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;

  /* Check the parameters */
  CHECK_PARAM(IS_WDT_INT_TYPE(intType));
  CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

  WDT_ENABLE_ACCESS();

  /* Deal with watchdog match/interrupt enable register,
    WRIE:watchdog reset/interrupt enable */
  tmpVal = BL_RD_REG(TIMER_BASE, TIMER_WMER);

  switch (intType) {
  case WDT_INT:
    if (intMask == UNMASK) {
      /* Enable this interrupt */
      /* 0 means generates a watchdog interrupt,
         a watchdog timer reset is not generated*/
      BL_WR_REG(TIMER_BASE, TIMER_WMER, BL_CLR_REG_BIT(tmpVal, TIMER_WRIE));
    } else {
      /* Disable this interrupt */
      /* 1 means generates a watchdog timer reset,
         a watchdog  interrupt is not generated*/
      BL_WR_REG(TIMER_BASE, TIMER_WMER, BL_SET_REG_BIT(tmpVal, TIMER_WRIE));
    }

    break;

  default:
    break;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  TIMER channel 0 interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER_CH0_IRQHandler(void) { TIMER_IntHandler(TIMER_CH0_IRQn, TIMER_CH0); }
#endif

/****************************************************************************/ /**
                                                                                * @brief  TIMER channel 1 interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER_CH1_IRQHandler(void) { TIMER_IntHandler(TIMER_CH1_IRQn, TIMER_CH1); }
#endif

/****************************************************************************/ /**
                                                                                * @brief  TIMER watchdog interrupt handler
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void TIMER_WDT_IRQHandler(void) {
  uint32_t tmpVal;

  WDT_ENABLE_ACCESS();

